In [ ]:
#use us_births data to compute the following using np:
    #extract the year, gender and births column from the data
    #compute the aggregation of sum of total birth, sum of female birth and sum of male birth, mean and median
    #compute the maximum births and minimum births
    #indicate the gender with minimum birth and maximum birth
    #indicate the year with minimum birth and maximum birth

In [4]:
import numpy as np
import pandas as pd
us_births = pd.read_csv("C:\\Users\\owner\\OneDrive\\Desktop\\sqi\\DATA SCIENCE\\Datasets\\us_births.csv")
us_births.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [5]:
us_year = np.array(us_births['year'])
us_gender = np.array(us_births['gender'])
us_b = np.array(us_births['births'])
print('Year of birth\n',us_year,'\n')
print('Gender\n', us_gender,'\n')
print('Births\n', us_b,'\n')

Year of birth
 [1969 1969 1969 ... 2008 2008 2008]

Gender
 ['F' 'M' 'F' ... 'M' 'F' 'M']

Births
 [  4046   4440   4454 ... 165468 173215 181235]

In [36]:
print('Sum of total births: ', us_b.sum())
print('Sum of female births: ',vvs_fb.sum())
print('Sum of male births: ',vvv_mb.sum())
print('mean: ', us_b.mean())
print('Median: ',np.median(us_b))

Sum of total births:  151774378
Sum of female births:  74035823
Sum of male births:  77738555
mean:  9762.293561458802
Median:  4814.0

In [44]:
# print(us_b.argmax())
# print(us_b.argmin())
print('Maximum birth: ', us_b[15514])
print('Minimum birth: ',us_b[4715])
print('gender with maximum birth: ',us_gender[15514])
print('gender with minimum birth: ',us_gender[4715])
print('Year with maximum birth: ',us_year[15514])
print('Year with minimum birth: ',us_year[4715])

15514
Maximum birth:  199622
Minimum birth:  1
gender with maximum birth:  M
gender with minimum birth:  F
Year with maximum birth:  2007
Year with minimum birth:  1975

In [23]:
print(us_births.gender)
print()
print(vvv.iloc[:5])

0        F
1        M
2        F
3        M
4        F
        ..
15542    M
15543    F
15544    M
15545    F
15546    M
Name: gender, Length: 15547, dtype: object

0    F
1    M
2    F
3    M
4    F
Name: gender, dtype: object

In [29]:
vvs = us_births[us_births.gender == 'F']
vvs

       year  month  day gender  births
0      1969      1  1.0      F    4046
2      1969      1  2.0      F    4454
4      1969      1  3.0      F    4548
6      1969      1  4.0      F    4440
8      1969      1  5.0      F    4192
...     ...    ...  ...    ...     ...
15537  2008      8  NaN      F  182713
15539  2008      9  NaN      F  179696
15541  2008     10  NaN      F  175314
15543  2008     11  NaN      F  158939
15545  2008     12  NaN      F  173215

[7776 rows x 5 columns]

In [33]:
import numpy as np
vvs_fb = np.array(vvs['births'])
vvs_fb
print('Sum of female gender :',vvs_fb.sum())

Sum of female gender : 74035823

In [27]:
vvv = us_births[us_births.gender == 'M']
vvv

       year  month  day gender  births
1      1969      1  1.0      M    4440
3      1969      1  2.0      M    4548
5      1969      1  3.0      M    4994
7      1969      1  4.0      M    4520
9      1969      1  5.0      M    4198
...     ...    ...  ...    ...     ...
15538  2008      8  NaN      M  191315
15540  2008      9  NaN      M  188964
15542  2008     10  NaN      M  183219
15544  2008     11  NaN      M  165468
15546  2008     12  NaN      M  181235

[7771 rows x 5 columns]

In [35]:
vvv_mb = np.array(vvv['births'])
vvv_mb
print('sum of Male births :',vvv_mb.sum())

sum of Male births : 77738555